**Question**-What is concatenation?

Merging or combining two or more lists,sets,strings,dictionaries,tuples,dataframes etc  is referred to as concatenation.
following are ways to concatenate

* **Concatenation in dataframes**

In [61]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[10, 11, 12, 13])

df2 = pd.DataFrame({'P': ['A4', 'A5', 'A6','A7'],
                        'Q': ['B4', 'B5','B6', 'B7'],
                        'R': ['C4', 'C5', 'C6', 'C7'],
                        'S': ['D4', 'D5','D6', 'D7']},
                         index=[14, 15, 16, 17])

In [63]:
df1

     A   B   C   D
10  A0  B0  C0  D0
11  A1  B1  C1  D1
12  A2  B2  C2  D2
13  A3  B3  C3  D3

In [64]:
df2

     P   Q   R   S
14  A4  B4  C4  D4
15  A5  B5  C5  D5
16  A6  B6  C6  D6
17  A7  B7  C7  D7

In [65]:
pd.concat([df1,df2], axis = 0)

D:\Python\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

      A    B    C    D    P    Q    R    S
10   A0   B0   C0   D0  NaN  NaN  NaN  NaN
11   A1   B1   C1   D1  NaN  NaN  NaN  NaN
12   A2   B2   C2   D2  NaN  NaN  NaN  NaN
13   A3   B3   C3   D3  NaN  NaN  NaN  NaN
14  NaN  NaN  NaN  NaN   A4   B4   C4   D4
15  NaN  NaN  NaN  NaN   A5   B5   C5   D5
16  NaN  NaN  NaN  NaN   A6   B6   C6   D6
17  NaN  NaN  NaN  NaN   A7   B7   C7   D7

* **Concatenation in string**

In [68]:
a='hello'

In [69]:
a+" world"

'hello world'

* **Concatenation in dictionaries**

In [72]:
d = {'key1':'value1','key2':'value2'}
d

{'key1': 'value1', 'key2': 'value2'}

In [74]:
d['animal'] = 'Dog'

In [75]:
d

{'key1': 'value1', 'key2': 'value2', 'animal': 'Dog'}

* **Concatenation in list**

In [76]:
my_list = [1,2,3]
my_list

[1, 2, 3]

In [77]:
my_list + ['new item']

[1, 2, 3, 'new item']

**Question**-Difference between append and concatenation?

Concat gives the flexibility to join based on the axis( all rows or all columns) 
**Append is the specific case(axis=0, join='outer') of concat** basically append is a specific case of a concatenation, while pd.concat() gives us more flexibility.

In [17]:
import pandas as pd
 
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[10, 11, 12, 13])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6','A7'],
                        'B': ['B4', 'B5','B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5','D6', 'D7']},
                         index=[14, 15, 16, 17])

In [18]:
df1

     A   B   C   D
10  A0  B0  C0  D0
11  A1  B1  C1  D1
12  A2  B2  C2  D2
13  A3  B3  C3  D3

In [19]:
df2

     A   B   C   D
14  A4  B4  C4  D4
15  A5  B5  C5  D5
16  A6  B6  C6  D6
17  A7  B7  C7  D7

In [20]:
df2.append(df1)

     A   B   C   D
14  A4  B4  C4  D4
15  A5  B5  C5  D5
16  A6  B6  C6  D6
17  A7  B7  C7  D7
10  A0  B0  C0  D0
11  A1  B1  C1  D1
12  A2  B2  C2  D2
13  A3  B3  C3  D3

In [22]:
pd.concat([df1,df2], axis=1,join = 'outer')

      A    B    C    D    A    B    C    D
10   A0   B0   C0   D0  NaN  NaN  NaN  NaN
11   A1   B1   C1   D1  NaN  NaN  NaN  NaN
12   A2   B2   C2   D2  NaN  NaN  NaN  NaN
13   A3   B3   C3   D3  NaN  NaN  NaN  NaN
14  NaN  NaN  NaN  NaN   A4   B4   C4   D4
15  NaN  NaN  NaN  NaN   A5   B5   C5   D5
16  NaN  NaN  NaN  NaN   A6   B6   C6   D6
17  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [24]:
pd.concat([df1,df2], axis=0,join = 'inner')

     A   B   C   D
10  A0  B0  C0  D0
11  A1  B1  C1  D1
12  A2  B2  C2  D2
13  A3  B3  C3  D3
14  A4  B4  C4  D4
15  A5  B5  C5  D5
16  A6  B6  C6  D6
17  A7  B7  C7  D7

**Question**-Explain Primary , Foreign and coposite key ?

**PRIMARY KEY**-A column or group of columns in a table which helps us to uniquely identifies every row in that table is called a primary key
EXAMPLE-

StudID	Roll No	First Name	LastName	Email
1	      11	Tom	         Price	  abc@gmail.com
2	      12	Nick	     Wright	  xyz@gmail.com
3	      13	Dana	     Natan	  mno@yahoo.com
here student id is the primary key

**FOREIGN KEY**-A foreign key is a column which is added to create a relationship with another table. Foreign keys help us to maintain data integrity and also allows navigation between two different instances of an entity. Every relationship in the model needs to be supported by a foreign key.

Example:

Example:

DeptCode	DeptName
   001	     Science
   002	     English
   005	     Computer
   
   
Teacher ID	Fname	Lname
  B002	    David	Warner
  B017	    Sara	Joseph
  B009	    Mike	Brunton
  
In this example, we have two table, teach and department in a school. However, there is no way to see which search work in which department.
In this table, adding the foreign key in Deptcode to the Teacher name, we can create a relationship between the two tables.

Teacher ID	DeptCode	Fname	Lname
  B002	    002 	    David	Warner
  B017      002	        Sara	Joseph
  B009	    001	        Mike	Brunton

**COMPOSITE KEY**-A key which has multiple attributes to uniquely identify rows in a table is called a composite key.

**Question**-Explain concepts of joins?

*A JOIN is a means for combining columns from one or more tables by using values common to eachother.*

Here are the different types of the JOINS :

* **(INNER) JOIN:**      Returns records that have matching values in both tables
* **LEFT (OUTER) JOIN**: Return all records from the left table, and the matched records from the right table
* **RIGHT (OUTER) JOIN**:Return all records from the right table, and the matched records from the left table
* **FULL (OUTER) JOIN**: Return all records when there is a match in either left or right table

In [47]:
import pandas as pd
import numpy as np
 
# data frame 1
d1 = {'Customer_id':pd.Series([1,2,3,4,5,6]),
  'Product':pd.Series(['Oven','Oven','Oven','Television','Television','Television'])}
df1 = pd.DataFrame(d1)
 
 
# data frame 2
d2 = {'Customer_id':pd.Series([2,4,6]),
    'State':pd.Series(['California','California','Texas'])}
df2 = pd.DataFrame(d2)

In [48]:
df1

   Customer_id     Product
0            1        Oven
1            2        Oven
2            3        Oven
3            4  Television
4            5  Television
5            6  Television

In [49]:
df2

   Customer_id       State
0            2  California
1            4  California
2            6       Texas

**(INNER) JOIN:**

In [55]:
#inner join in python pandas
#Return only the rows in which the left table have matching keys in the right table

pd.merge(df1, df2, on='Customer_id', how='inner')

   Customer_id     Product       State
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas

 **LEFT (OUTER) JOIN**

In [59]:
# Return all rows from the left table, and any rows with matching keys from the right table.
# left join in python
pd.merge(df1, df2, on='Customer_id', how='left')

   Customer_id     Product       State
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas

**RIGHT (OUTER) JOIN**

In [60]:
# Return all rows from the right table, and any rows with matching keys from the left table
# right join in python pandas
 
pd.merge(df1, df2, on='Customer_id', how='right')

   Customer_id     Product       State
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas

**FULL (OUTER) JOIN**

In [57]:
# Returns all rows from both tables, join records from the left which have matching keys in the right table.
# outer join in python pandas
pd.merge(df1, df2, on='Customer_id', how='outer')

   Customer_id     Product       State
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas

**Question**-Project Wine Quality?

In [25]:
import pandas as pd
import numpy as np

In [26]:
x_red=pd.read_csv("C:\\Users\\tanya\\Downloads\\python files and assignments\\winequality-red.csv",sep=";")

In [27]:
x_white=pd.read_csv("C:\\Users\\tanya\\Downloads\\python files and assignments\\winequality-white.CSV",sep=";")

In [28]:
x_red.head(6)

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
5,7.4,0.66,0.00,1.8,0.075,13.0,40.0,0.9978,3.51,0.56,9.4,5

In [29]:
x_white.head(6)

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.0,0.27,0.36,20.7,0.045,45.0,170.0,1.0010,3.00,0.45,8.8,6
1,6.3,0.30,0.34,1.6,0.049,14.0,132.0,0.9940,3.30,0.49,9.5,6
2,8.1,0.28,0.40,6.9,0.050,30.0,97.0,0.9951,3.26,0.44,10.1,6
3,7.2,0.23,0.32,8.5,0.058,47.0,186.0,0.9956,3.19,0.40,9.9,6
4,7.2,0.23,0.32,8.5,0.058,47.0,186.0,0.9956,3.19,0.40,9.9,6
5,8.1,0.28,0.40,6.9,0.050,30.0,97.0,0.9951,3.26,0.44,10.1,6

In [30]:
print(x_red.columns, x_white.columns, end="     ") # all the column names are same 
# what should we do separate them and concatenate them.

Index(['fixed acidity', 'volatile acidity', 'citric acid', 'residual sugar',
       'chlorides', 'free sulfur dioxide', 'total sulfur dioxide', 'density',
       'pH', 'sulphates', 'alcohol', 'quality'],
      dtype='object') Index(['fixed acidity', 'volatile acidity', 'citric acid', 'residual sugar',
       'chlorides', 'free sulfur dioxide', 'total sulfur dioxide', 'density',
       'pH', 'sulphates', 'alcohol', 'quality'],
      dtype='object')

In [32]:
x_red.shape

(1599, 12)

In [33]:
x_white.shape

(4898, 12)

In [34]:
red=np.repeat("red",1599)

In [35]:
white=np.repeat("red",4898)

In [36]:
x_red['color']=red

In [37]:
x_white['color']=white

In [38]:
wine=pd.concat([x_red,x_white])

In [39]:
wine.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality,color
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5,red
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5,red
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5,red
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6,red
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5,red

In [ ]:
wine.to_csv("C:\\Users\\tanya\\Downloads\\python files and assignments\\wine_quality_new.csv",index = False)